In [1]:
import pandas as pd
import matplotlib.pyplot as mp
from sklearn import tree
%matplotlib inline

In [6]:
# reading the csv file with pandas reader
train = pd.read_csv("data/train.csv")
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [14]:
train = train[train['Age'].notna()]
train = train[train['Sex'].notna()]
train = train[train['Pclass'].notna()]
train = train.drop(columns=['SibSp', 'Parch', 'Fare', 'Ticket' ,'Cabin', 'Embarked'])
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0
886,887,0,2,"Montvila, Rev. Juozas",male,27.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0

In [8]:
test = pd.read_csv("data/test.csv")
test.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [15]:
test = test[test['Age'].notna()]
test = test[test['Sex'].notna()]
test = test[test['Pclass'].notna()]
test = test.drop(columns=['SibSp', 'Parch', 'Fare', 'Ticket' ,'Cabin', 'Embarked'])
test.tail()

,PassengerId,Pclass,Name,Sex,Age
409,1301,3,"Peacock, Miss. Treasteall",female,3.0
411,1303,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0
412,1304,3,"Henriksson, Miss. Jenny Lovisa",female,28.0
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5